In [208]:
pip install xlrd

Requirement already satisfied: xlrd in c:\users\vonke\anaconda3\lib\site-packages (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [209]:
#Importing our defined functions
from clean_data_functions import *

In [210]:
import pandas as pd

url = 'https://raw.githubusercontent.com/johann1043/Data-Science-Quest/main/jobs_in_data.csv'
data_science_df = pd.read_csv(url)

# Cleaning data_science Data Frame

In [211]:
#Getting initial overview of data frame
data_frame_overview(data_science_df)

Column names:
 Index(['work_year', 'job_title', 'job_category', 'salary_currency', 'salary',
       'salary_in_usd', 'employee_residence', 'experience_level',
       'employment_type', 'work_setting', 'company_location', 'company_size'],
      dtype='object')

Dimensions: (9355, 12)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9355 entries, 0 to 9354
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           9355 non-null   int64
 1   job_title           9355 non-null   object
 2   job_category        9355 non-null   object
 3   salary_currency     9355 non-null   object
 4   salary              9355 non-null   int64
 5   salary_in_usd       9355 non-null   int64
 6   employee_residence  9355 non-null   object
 7   experience_level    9355 non-null   object
 8   employment_type     9355 non-null   object
 9   work_setting        9355 non-null   object
 10  company_location    9355 non-null   object
 11  company_size        9355 non-null   object
dtypes: int64(3), object(9)
memory usage: 877.2+ KB
None

,work_year,job_title,job_category,salary_currency,salary,salary_in_usd,employee_residence,experience_level,employment_type,work_setting,company_location,company_size
0,2023,Data DevOps Engineer,Data Engineering,EUR,88000,95012,Germany,Mid-level,Full-time,Hybrid,Germany,L
1,2023,Data Architect,Data Architecture and Modeling,USD,186000,186000,United States,Senior,Full-time,In-person,United States,M
2,2023,Data Architect,Data Architecture and Modeling,USD,81800,81800,United States,Senior,Full-time,In-person,United States,M
3,2023,Data Scientist,Data Science and Research,USD,212000,212000,United States,Senior,Full-time,In-person,United States,M
4,2023,Data Scientist,Data Science and Research,USD,93300,93300,United States,Senior,Full-time,In-person,United States,M
5,2023,Data Scientist,Data Science and Research,USD,130000,130000,United States,Senior,Full-time,Remote,United States,M
6,2023,Data Scientist,Data Science and Research,USD,100000,100000,United States,Senior,Full-time,Remote,United States,M
7,2023,Machine Learning Researcher,Machine Learning and AI,USD,224400,224400,United States,Mid-level,Full-time,In-person,United States,M
8,2023,Machine Learning Researcher,Machine Learning and AI,USD,138700,138700,United States,Mid-level,Full-time,In-person,United States,M
9,2023,Data Engineer,Data Engineering,USD,210000,210000,United States,Executive,Full-time,Remote,United States,M

In [212]:
#Applying the reformatting the names of the columns
column_name_mapping = {'work_year' : 'year', 'employee_residence' : 'country'}

format_column_names(data_science_df, column_name_mapping)

New column names:
 Index(['year', 'job_title', 'job_category', 'salary_currency', 'salary',
       'salary_in_usd', 'country', 'experience_level', 'employment_type',
       'work_setting', 'company_location', 'company_size'],
      dtype='object')

In [213]:
null_check(data_science_df)

Total null values per row:
0       0
1       0
2       0
3       0
4       0
       ..
9350    0
9351    0
9352    0
9353    0
9354    0
Length: 9355, dtype: int64

Total null values per column:
year                0
job_title           0
job_category        0
salary_currency     0
salary              0
salary_in_usd       0
country             0
experience_level    0
employment_type     0
work_setting        0
company_location    0
company_size        0
dtype: int64

In [214]:
# dup_check(data_science_df)

In [215]:
# duplicates = data_science_df.duplicated(keep=False)

# duplicate_rows = data_science_df.loc[duplicates]
# print(duplicate_rows)

In [216]:
# drop_dup_reset(data_science_df)

In [217]:
data_science_df = data_science_df.drop(['job_title', 'salary_currency','salary','company_location','company_size'], axis=1)
data_science_df

,year,job_category,salary_in_usd,country,experience_level,employment_type,work_setting
0,2023,Data Engineering,95012,Germany,Mid-level,Full-time,Hybrid
1,2023,Data Architecture and Modeling,186000,United States,Senior,Full-time,In-person
2,2023,Data Architecture and Modeling,81800,United States,Senior,Full-time,In-person
3,2023,Data Science and Research,212000,United States,Senior,Full-time,In-person
4,2023,Data Science and Research,93300,United States,Senior,Full-time,In-person
...,...,...,...,...,...,...,...
9350,2021,Data Management and Strategy,165000,United States,Senior,Full-time,Remote
9351,2020,Data Science and Research,412000,United States,Senior,Full-time,Remote
9352,2021,Data Science and Research,151000,United States,Mid-level,Full-time,Remote
9353,2020,Data Science and Research,105000,United States,Entry-level,Full-time,Remote
9354,2020,Data Analysis,100000,United States,Entry-level,Contract,Remote

In [218]:
data_science_df = data_science_df[data_science_df['employment_type'] == 'Full-time']
data_science_df

,year,job_category,salary_in_usd,country,experience_level,employment_type,work_setting
0,2023,Data Engineering,95012,Germany,Mid-level,Full-time,Hybrid
1,2023,Data Architecture and Modeling,186000,United States,Senior,Full-time,In-person
2,2023,Data Architecture and Modeling,81800,United States,Senior,Full-time,In-person
3,2023,Data Science and Research,212000,United States,Senior,Full-time,In-person
4,2023,Data Science and Research,93300,United States,Senior,Full-time,In-person
...,...,...,...,...,...,...,...
9349,2021,Data Engineering,28369,Malta,Mid-level,Full-time,Hybrid
9350,2021,Data Management and Strategy,165000,United States,Senior,Full-time,Remote
9351,2020,Data Science and Research,412000,United States,Senior,Full-time,Remote
9352,2021,Data Science and Research,151000,United States,Mid-level,Full-time,Remote
9353,2020,Data Science and Research,105000,United States,Entry-level,Full-time,Remote

In [219]:
data_science_df = data_science_df.drop(['employment_type'], axis=1)
data_science_df

,year,job_category,salary_in_usd,country,experience_level,work_setting
0,2023,Data Engineering,95012,Germany,Mid-level,Hybrid
1,2023,Data Architecture and Modeling,186000,United States,Senior,In-person
2,2023,Data Architecture and Modeling,81800,United States,Senior,In-person
3,2023,Data Science and Research,212000,United States,Senior,In-person
4,2023,Data Science and Research,93300,United States,Senior,In-person
...,...,...,...,...,...,...
9349,2021,Data Engineering,28369,Malta,Mid-level,Hybrid
9350,2021,Data Management and Strategy,165000,United States,Senior,Remote
9351,2020,Data Science and Research,412000,United States,Senior,Remote
9352,2021,Data Science and Research,151000,United States,Mid-level,Remote
9353,2020,Data Science and Research,105000,United States,Entry-level,Remote

# Cleaning global_salary Data Frame

In [220]:
import pandas as pd

url = 'https://raw.githubusercontent.com/johann1043/Data-Science-Quest/main/salary_data.csv'
global_salary_df = pd.read_csv(url)

In [221]:
global_salary_df

,country_name,continent_name,wage_span,median_salary,average_salary,lowest_salary,highest_salary
0,Afghanistan,Asia,Monthly,853.740000,1001.150000,252.530000,4460.970000
1,Aland Islands,Europe,Monthly,3319.240000,3858.350000,972.520000,17124.740000
2,Albania,Europe,Monthly,832.840000,956.920000,241.220000,4258.490000
3,Algeria,Africa,Monthly,1148.840000,1308.810000,330.110000,5824.180000
4,American Samoa,Oceania,Monthly,1390.000000,1570.000000,400.000000,6980.000000
...,...,...,...,...,...,...,...
216,Virgin Islands (US),North America,Monthly,2380.000000,2710.000000,680.000000,12000.000000
217,Western Sahara,Africa,Monthly,908.560000,1011.670000,254.860000,4503.890000
218,Yemen,Asia,Monthly,120.980000,133.360000,33.620000,594.930000
219,Zambia,Africa,Monthly,0.261335,0.285524,0.072092,1.271103
220,Zimbabwe,Africa,Monthly,555.402040,602.376350,151.423050,2674.772000

In [222]:
#Getting initial overview of data frame
data_frame_overview(global_salary_df)

Column names:
 Index(['country_name', 'continent_name', 'wage_span', 'median_salary',
       'average_salary', 'lowest_salary', 'highest_salary'],
      dtype='object')

Dimensions: (221, 7)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 221 entries, 0 to 220
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   country_name    221 non-null    object
 1   continent_name  221 non-null    object
 2   wage_span       221 non-null    object
 3   median_salary   221 non-null    float64
 4   average_salary  221 non-null    float64
 5   lowest_salary   221 non-null    float64
 6   highest_salary  221 non-null    float64
dtypes: float64(4), object(3)
memory usage: 12.2+ KB
None

,country_name,continent_name,wage_span,median_salary,average_salary,lowest_salary,highest_salary
0,Afghanistan,Asia,Monthly,853.74,1001.15,252.53,4460.97
1,Aland Islands,Europe,Monthly,3319.24,3858.35,972.52,17124.74
2,Albania,Europe,Monthly,832.84,956.92,241.22,4258.49
3,Algeria,Africa,Monthly,1148.84,1308.81,330.11,5824.18
4,American Samoa,Oceania,Monthly,1390.00,1570.00,400.00,6980.00
5,Andorra,Europe,Monthly,3668.08,4069.77,1120.51,17653.28
6,Angola,Africa,Monthly,284.39,314.39,79.32,1403.96
7,Antigua and Barbuda,Caribbean,Monthly,1548.15,1677.78,422.22,7444.44
8,Argentina,South America,Monthly,110.28,129.42,32.57,577.13
9,Armenia,Asia,Monthly,1700.25,1974.32,497.39,8780.39

In [223]:
#Applying the reformatting the names of the columns
column_name_mapping = {'country_name' : 'country', 'average_salary': 'general_average_salary'}

format_column_names(global_salary_df, column_name_mapping)

New column names:
 Index(['country', 'continent_name', 'wage_span', 'median_salary',
       'general_average_salary', 'lowest_salary', 'highest_salary'],
      dtype='object')

In [224]:
null_check(global_salary_df)

Total null values per row:
0      0
1      0
2      0
3      0
4      0
      ..
216    0
217    0
218    0
219    0
220    0
Length: 221, dtype: int64

Total null values per column:
country                   0
continent_name            0
wage_span                 0
median_salary             0
general_average_salary    0
lowest_salary             0
highest_salary            0
dtype: int64

In [225]:
dup_check(global_salary_df)

Duplicates found: False

Number of duplicates: 0

In [226]:
global_salary_df = global_salary_df.drop(['continent_name', 'wage_span','median_salary','lowest_salary','highest_salary'], axis=1)
global_salary_df

                 country  general_average_salary
0            Afghanistan             1001.150000
1          Aland Islands             3858.350000
2                Albania              956.920000
3                Algeria             1308.810000
4         American Samoa             1570.000000
..                   ...                     ...
216  Virgin Islands (US)             2710.000000
217       Western Sahara             1011.670000
218                Yemen              133.360000
219               Zambia                0.285524
220             Zimbabwe              602.376350

[221 rows x 2 columns]

In [227]:
global_salary_df['general_average_salary'] = global_salary_df['general_average_salary'].map(lambda x: x * 12).round(2)
global_salary_df

                 country  general_average_salary
0            Afghanistan                12013.80
1          Aland Islands                46300.20
2                Albania                11483.04
3                Algeria                15705.72
4         American Samoa                18840.00
..                   ...                     ...
216  Virgin Islands (US)                32520.00
217       Western Sahara                12140.04
218                Yemen                 1600.32
219               Zambia                    3.43
220             Zimbabwe                 7228.52

[221 rows x 2 columns]

In [228]:
country_list = data_science_df['country'].unique()

In [229]:
for country in country_list:
    # Check if the country is in the 'country' column of global_salary_df
    if country in global_salary_df['country'].values:
        True
    else:
        print(f'Cannot find {country}.')

Cannot find South Korea.
Cannot find Kuwait.

# Merge the two Data Frames and export

In [230]:
# Merge DataFrames on the common column
clean_data_df = pd.merge(data_science_df, global_salary_df, on='country', how='inner')
clean_data_df

,year,job_category,salary_in_usd,country,experience_level,work_setting,general_average_salary
0,2023,Data Engineering,95012,Germany,Mid-level,Hybrid,48583.56
1,2023,Data Analysis,42107,Germany,Mid-level,Hybrid,48583.56
2,2023,Machine Learning and AI,64781,Germany,Senior,Hybrid,48583.56
3,2023,Machine Learning and AI,129562,Germany,Senior,Remote,48583.56
4,2023,Data Engineering,107968,Germany,Senior,Remote,48583.56
...,...,...,...,...,...,...,...
9302,2020,Data Engineering,125000,New Zealand,Senior,Hybrid,58440.72
9303,2021,Data Engineering,66022,Hong Kong,Mid-level,Hybrid,56245.20
9304,2020,Machine Learning and AI,45896,Denmark,Entry-level,Hybrid,69348.48
9305,2021,Data Analysis,59102,Luxembourg,Entry-level,Remote,62537.04
9306,2021,Data Engineering,28369,Malta,Mid-level,Hybrid,58858.32

In [231]:
clean_data_df.to_csv('clean_data.csv', index=False)